Revit 2027 API
Railing.TopRail Property
 The top rail of the railing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TopRail { get; }
Public ReadOnly Property TopRail As ElementId
	Get
public:
property ElementId^ TopRail {
	ElementId^ get ();
}
member TopRail : ElementId with get
Property Value
ElementId
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace